In [1]:
import pandas as pd

In [4]:
data = {"Name" : ["Mohtshim","Ali","Ahsan","Bilal","Mohtshim"],
       "Age" : [20,21,22,20,20],
        "Address" : ["islamabad","lahore","karachi","Islamabad","Islamabad"]
       }
df = pd.DataFrame(data)
df

       Name  Age    Address
0  Mohtshim   20  islamabad
1       Ali   21     lahore
2     Ahsan   22    karachi
3     Bilal   20  Islamabad
4  Mohtshim   20  Islamabad

In [9]:
def my_func(data):
    if data.Name == "Mohtshim":
        data["Address"] = "Test"
    return data
df.apply(my_func,axis =1)

       Name  Age    Address
0  Mohtshim   20       Test
1       Ali   21     lahore
2     Ahsan   22    karachi
3     Bilal   20  Islamabad
4  Mohtshim   20       Test

In [5]:
df.Name

0    Mohtshim
1         Ali
2       Ahsan
3       Bilal
4    Mohtshim
Name: Name, dtype: object